export const TYPES = {
  SUCCESS: "Success",
  ERROR: "Error",
};

export const MESSAGES = {
  GLOBAL: {
    REQUIRED: "لطفا فیلدهای ضروری را پر کنید",
    ERROR: "در فرآیند درخواست شده خطایی بوجود آمده",
    LOADING_ERROR: "خطایی در هنگام بارگزاری داده ها رخ داده",
  },
  LOGIN: {
    SUCCESS: "با موفقیت وارد شدید",
    FAILED: "کاربری با این نام کاربری و رمز عبور پیدا نشد",
  },
  REGISTER: {
    USERNAME: "نام کاربری درست وارد نشده یا قبلا استفاده شده",
    EMAIL: "ایمیل درست وارد نشده یا قبلا استفاده شده",
    PASSWORD: "رمز عبور انتخاب شده ضعیف است یا باهم تطابق ندارند",
    SUCCESS: "با موفقیت ثبت نام شدید",
    FAILED: "خطایی در ثبت نام رخ داده. دوباره تلاش کنید",
  },
  PROJECT: {
    SUCCESS: "پروژه با موفقیت ساخته شد",
    FAILED: "مشکلی در ساخت پروژه وجود دارد",
    REMOVED: "پروژه با موفقیت حذف شد",
    REMOVE_FAILED: "مشکلی در حذف پروژه بوجود آمده",
  },
  PROJECT_REQUEST: {
    ACCEPTED: "درخواست مورد نظر با موفقیت قبول شد",
    CREATED: "درخواست شما برای پروژه ثبت شد",
    REMOVED: "درخواست شما از پروژه حذف شد",
    FAILED: "مشکلی در درخواست شما بوجود آمده",
  },
  PROFILE_EDIT: {
    SUCCESS: "با موفقیت ویرایش شد",
    FAILED: "مشکلی در ویرایش پروفایل شما وجود دارد",
    IMAGE_SUCCESS: "عکس شما با موفقیت عوض شد",
    IMAGE_FAILED: "مشکلی در ویرایش عکس پروفایل بوجود آمده",
  },
};
